tests/loadTest.yml
config:
    target: 'http://localhost:3000'
    phases:
      - duration: 60
        arrivalRate: 20
    processor: "./loadTest.js"
scenarios:
    - flow:
        - post:
            url: "/auth/login"
            json: { role: "admin" }
            capture:
              json: "$.token"
              as: "token"
        - post:
            url: "/tasks"
            headers:
              Authorization: "Bearer {{ token }}"
            json:
              payload: { test: "{{ $randomString() }}" }
              priority: "{{ $randomNumber(0, 2) }}"